stm32-hotspot/WB55-p2p-Client-Legacy-OOB-UART/STM32_WPAN/App/app_ble.c
/* USER CODE END 0 */

/* Functions Definition ------------------------------------------------------*/
void APP_BLE_Init(void)
{
  SHCI_CmdStatus_t status;
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  /* USER CODE BEGIN APP_BLE_Init_1 */

  /* USER CODE END APP_BLE_Init_1 */

  SHCI_C2_Ble_Init_Cmd_Packet_t ble_init_cmd_packet =
  {
    {{0,0,0}},                          /**< Header unused */
    {0,                                 /** pBleBufferAddress not used */
     0,                                 /** BleBufferSize not used */
     CFG_BLE_NUM_GATT_ATTRIBUTES,
     CFG_BLE_NUM_GATT_SERVICES,
     CFG_BLE_ATT_VALUE_ARRAY_SIZE,
     CFG_BLE_NUM_LINK,
     CFG_BLE_DATA_LENGTH_EXTENSION,
     CFG_BLE_PREPARE_WRITE_LIST_SIZE,
     CFG_BLE_MBLOCK_COUNT,
     CFG_BLE_MAX_ATT_MTU,
     CFG_BLE_SLAVE_SCA,
     CFG_BLE_MASTER_SCA,
     CFG_BLE_LS_SOURCE,
     CFG_BLE_MAX_CONN_EVENT_LENGTH,
     CFG_BLE_HSE_STARTUP_TIME,
     CFG_BLE_VITERBI_MODE,
     CFG_BLE_OPTIONS,
     0,
     CFG_BLE_MAX_COC_INITIATOR_NBR,
     CFG_BLE_MIN_TX_POWER,
     CFG_BLE_MAX_TX_POWER,
     CFG_BLE_RX_MODEL_CONFIG,
     CFG_BLE_MAX_ADV_SET_NBR,
     CFG_BLE_MAX_ADV_DATA_LEN,
     CFG_BLE_TX_PATH_COMPENS,
     CFG_BLE_RX_PATH_COMPENS,
     CFG_BLE_CORE_VERSION,
     CFG_BLE_OPTIONS_EXT
    }
  };

  /**
   * Initialize Ble Transport Layer
   */
  Ble_Tl_Init();

  /**
   * Do not allow standby in the application
   */
  UTIL_LPM_SetOffMode(1 << CFG_LPM_APP_BLE, UTIL_LPM_DISABLE);

  /**
   * Register the hci transport layer to handle BLE User Asynchronous Events
   */
  UTIL_SEQ_RegTask(1<<CFG_TASK_HCI_ASYNCH_EVT_ID, UTIL_SEQ_RFU, hci_user_evt_proc);

  /**
   * Starts the BLE Stack on CPU2
   */
  status = SHCI_C2_BLE_Init(&ble_init_cmd_packet);
  if (status != SHCI_Success)
  {
    APP_DBG_MSG("  Fail   : SHCI_C2_BLE_Init command, result: 0x%02x\n\r", status);
    /* if you are here, maybe CPU2 doesn't contain STM32WB_Copro_Wireless_Binaries, see Release_Notes.html */
    Error_Handler();
  }
  else
  {
    APP_DBG_MSG("  Success: SHCI_C2_BLE_Init command\n\r");
  }

  /**
   * Initialization of HCI & GATT & GAP layer
   */
  Ble_Hci_Gap_Gatt_Init();

  /**
   * Initialization of the BLE Services
   */
  SVCCTL_Init();

  /**
   * From here, all initialization are BLE application specific
   */
  UTIL_SEQ_RegTask(1<<CFG_TASK_START_SCAN_ID, UTIL_SEQ_RFU, Scan_Request);
  UTIL_SEQ_RegTask(1<<CFG_TASK_CONN_DEV_1_ID, UTIL_SEQ_RFU, Connect_Request);

  /**
   * Initialization of the BLE App Context
   */
  BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;

  /*Radio mask Activity*/
#if (OOB_DEMO != 0)
  ret = aci_hal_set_radio_activity_mask(0x0020);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_hal_set_radio_activity_mask command, result: 0x%x \n\r", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: aci_hal_set_radio_activity_mask command\n\r");
  }
  APP_DBG_MSG("\n");
#endif
  /**
   * Initialize P2P Client Application
   */
  P2PC_APP_Init();

  /* USER CODE BEGIN APP_BLE_Init_3 */
  UTIL_SEQ_RegTask(1<<CFG_TASK_SEND_OOB_DATA_ID, UTIL_SEQ_RFU, send_oob_data); // [STM]
  
  uint8_t events[8]={0x9F,0x01,0x00,0x00,0x00,0x00,0x00,0x00};
  // [STM] LE read local P-256 public key complete event + LE generate DHKey complete event + and other events (check AN5270)
  
  HAL_GPIO_WritePin(LED_RED_GPIO_Port, LED_RED_Pin, GPIO_PIN_SET);
  
  ret = hci_le_set_event_mask(events);
  ret |= hci_le_read_local_p256_public_key();
  if(ret == BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Success: hci_le_set_event_mask and hci_le_read_local_p256_public_key command.\n");
    APP_DBG_MSG("  Waiting for HCI_LE_READ_LOCAL_P256_PUBLIC_KEY_COMPLETE_EVENT\n");
    UTIL_SEQ_WaitEvt(1 << CFG_WAIT_EVT_READ_LOCAL_P256_PUBLIC_KEY_ID);
    
    // [STM] Generate OOB data
    ret = aci_gap_set_oob_data(0x00, // OOB device type = local device
                               0x00, 
                               0x00,
                               0x00,
                               0x00,
                               0x00);
    if(ret != 0)
    {
      HAL_GPIO_WritePin(LED_RED_GPIO_Port, LED_RED_Pin, GPIO_PIN_SET);
      APP_DBG_MSG("  Fail   : aci_gap_set_oob_data, result: 0x%x\n", ret);
    }
    else{
      APP_DBG_MSG("  Success: aci_gap_set_oob_data\n");
    }
    
    ret = aci_gap_get_oob_data(0x00, &m_oob_uart_data.address_type, m_oob_uart_data.address, &m_oob_uart_data.tk_size, m_oob_uart_data.tk);
    if(ret != 0)
    {
      HAL_GPIO_WritePin(LED_RED_GPIO_Port, LED_RED_Pin, GPIO_PIN_SET);
      APP_DBG_MSG("  Fail   : aci_gap_get_oob_data, result: 0x%x\n", ret);
    }
    else{
      APP_DBG_MSG("  Success: aci_gap_get_oob_data\r\n");
      APP_DBG_MSG("\r\n BLE Client address (type %s) %02X:%02X:%02X:%02X:%02X:%02X\r\n",
              m_oob_uart_data.address_type == 0 ? "Public" : "Random",
              m_oob_uart_data.address[5], m_oob_uart_data.address[4], m_oob_uart_data.address[3],
              m_oob_uart_data.address[2], m_oob_uart_data.address[1], m_oob_uart_data.address[0]);
      ble_oob_data_log(m_oob_uart_data.tk_size,m_oob_uart_data.tk);
      APP_DBG_MSG(" = Press SW1 to send OOB data via UART to BLE Server =\r\n\r\n");
    }
  }
  else
  {
    APP_DBG_MSG("  Fail   : hci_le_set_event_mask and hci_le_read_local_p256_public_key command, result: 0x%x\n", ret);
  }
  /* USER CODE END APP_BLE_Init_3 */

#if (OOB_DEMO != 0)
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(BleApplicationContext.SwitchOffGPIO_timer_Id), hw_ts_SingleShot, Switch_OFF_GPIO);
#endif

#if (OOB_DEMO == 0)
  /**
   * Start scanning
   */
  UTIL_SEQ_SetTask(1 << CFG_TASK_START_SCAN_ID, CFG_SCH_PRIO_0);
#endif
  /* USER CODE BEGIN APP_BLE_Init_2 */
  UTIL_SEQ_RegTask(1<<CFG_TASK_OOB_PROCESS_ID, UTIL_SEQ_RFU, ble_oob_process);
  UTIL_SEQ_RegTask(1<<CFG_TASK_BLE_CLIENT_PAIRING_REQUEST_ID, UTIL_SEQ_RFU, ble_client_pairing_request);
  
  HW_UART_Receive_IT(hw_uart1, (uint8_t *)&m_oob_remote_data, sizeof(m_oob_remote_data), uart_rx_callback);
  /* USER CODE END APP_BLE_Init_2 */
  return;
}

