stm32-hotspot/WB55-p2p-Client-Legacy-OOB-UART/STM32_WPAN/App/app_ble.c
    }
    else
    {
      /* USER CODE BEGIN BLE_CONNECT_FAILED */
      HAL_GPIO_WritePin(LED_RED_GPIO_Port, LED_RED_Pin, GPIO_PIN_SET);
      /* USER CODE END BLE_CONNECT_FAILED */
      BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;

    }
  }
  /* USER CODE BEGIN Connect_Request_2 */

  /* USER CODE END Connect_Request_2 */
  return;
}

static void Switch_OFF_GPIO()
{
  /* USER CODE BEGIN Switch_OFF_GPIO */
  HAL_GPIO_WritePin(LED_GREEN_GPIO_Port, LED_GREEN_Pin, GPIO_PIN_RESET);
  /* USER CODE END Switch_OFF_GPIO */
}

const uint8_t* BleGetBdAddress(void)
{
  uint8_t *otp_addr;
  const uint8_t *bd_addr;
  uint32_t udn;
  uint32_t company_id;
  uint32_t device_id;

  udn = LL_FLASH_GetUDN();

  if(udn != 0xFFFFFFFF)
  {
    company_id = LL_FLASH_GetSTCompanyID();
    device_id = LL_FLASH_GetDeviceID();

  /**
   * Public Address with the ST company ID
   * bit[47:24] : 24bits (OUI) equal to the company ID
   * bit[23:16] : Device ID.
   * bit[15:0] : The last 16bits from the UDN
   * Note: In order to use the Public Address in a final product, a dedicated
   * 24bits company ID (OUI) shall be bought.
   */
   bd_addr_udn[0] = (uint8_t)(udn & 0x000000FF);
   bd_addr_udn[1] = (uint8_t)((udn & 0x0000FF00) >> 8);
   bd_addr_udn[2] = (uint8_t)device_id;
   bd_addr_udn[3] = (uint8_t)(company_id & 0x000000FF);
   bd_addr_udn[4] = (uint8_t)((company_id & 0x0000FF00) >> 8);
   bd_addr_udn[5] = (uint8_t)((company_id & 0x00FF0000) >> 16);

   bd_addr = (const uint8_t *)bd_addr_udn;
  }
  else
  {
    otp_addr = OTP_Read(0);
    if(otp_addr)
    {
      bd_addr = ((OTP_ID0_t*)otp_addr)->bd_address;
    }
    else
    {
      bd_addr = M_bd_addr;
    }
  }

  return bd_addr;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */
static void send_oob_data(void)
{
  HAL_StatusTypeDef status = HAL_UART_Transmit(&hlpuart1, (uint8_t *)&m_oob_uart_data, sizeof(m_oob_uart_data), 1000);
  
  APP_DBG_MSG("<<== BLE Client OOB data - UART TX to BLE server status = 0x%02X\r\n\r\n", status);
  
  //UTIL_SEQ_SetTask(1 << CFG_TASK_START_SCAN_ID, CFG_SCH_PRIO_0); // [STM] Do not scan
}
/* USER CODE END FD_LOCAL_FUNCTIONS */

/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/
void hci_notify_asynch_evt(void* pdata)
{
  UTIL_SEQ_SetTask(1 << CFG_TASK_HCI_ASYNCH_EVT_ID, CFG_SCH_PRIO_0);
  return;
}

void hci_cmd_resp_release(uint32_t flag)
{
  UTIL_SEQ_SetEvt(1 << CFG_IDLEEVT_HCI_CMD_EVT_RSP_ID);
  return;
}

void hci_cmd_resp_wait(uint32_t timeout)
{
  UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_HCI_CMD_EVT_RSP_ID);
  return;
}

static void BLE_UserEvtRx(void * pPayload)
{
  SVCCTL_UserEvtFlowStatus_t svctl_return_status;
  tHCI_UserEvtRxParam *pParam;

  pParam = (tHCI_UserEvtRxParam *)pPayload;

  svctl_return_status = SVCCTL_UserEvtRx((void *)&(pParam->pckt->evtserial));
  if (svctl_return_status != SVCCTL_UserEvtFlowDisable)
  {
    pParam->status = HCI_TL_UserEventFlow_Enable;
  }
  else
  {
    pParam->status = HCI_TL_UserEventFlow_Disable;
  }

  return;
}

static void BLE_StatusNot(HCI_TL_CmdStatus_t status)
{
  uint32_t task_id_list;
  switch (status)
  {
    case HCI_TL_CmdBusy:
      /**
       * All tasks that may send an aci/hci commands shall be listed here
       * This is to prevent a new command is sent while one is already pending
       */
      task_id_list = (1 << CFG_LAST_TASK_ID_WITH_HCICMD) - 1;
      UTIL_SEQ_PauseTask(task_id_list);
      break;

    case HCI_TL_CmdAvailable:
      /**
       * All tasks that may send an aci/hci commands shall be listed here
       * This is to prevent a new command is sent while one is already pending
       */
      task_id_list = (1 << CFG_LAST_TASK_ID_WITH_HCICMD) - 1;
      UTIL_SEQ_ResumeTask(task_id_list);
      break;

    default:
      break;
  }
  return;
}

void SVCCTL_ResumeUserEventFlow(void)
{
  hci_resume_flow();
  return;
}

/**
  * @brief  Run OOB process, set the OOB data arrived via OOB communication (which is UART in this case)
  * @param p_data: BLE server data that has Server device's address and address type
  * @retval none
  */
void APP_BLE_set_oob(app_ble_server_data_t *p_data)
{
  tBleStatus status;
  
  status = aci_gap_set_oob_data(0x01, // Remote device
                                p_data->address_type, // BLE server address type
                                p_data->address, // BLE server address
                                0x00, // OOB Data type - TK
                                m_oob_uart_data.tk_size, // TK size
                                m_oob_uart_data.tk);  // TK
  
  APP_DBG_MSG("==>> aci_gap_set_oob_data (Remote device) result = 0x%02X\r\n", status);
  APP_DBG_MSG("<<== Received BLE Server address (type %s) %02X:%02X:%02X:%02X:%02X:%02X, schedule to connect with Server\r\n",
              p_data->address_type == 0 ? "Public" : "Random",
              p_data->address[5], p_data->address[4], p_data->address[3],
              p_data->address[2], p_data->address[1], p_data->address[0]);
  
  // [STM] Configure REMOTE (BLE Server) address data to connect via Bluetooth
  BleApplicationContext.DeviceServerFound = 0x01;
  SERVER_REMOTE_ADDR_TYPE = p_data->address_type;
  memcpy(SERVER_REMOTE_BDADDR, p_data->address, sizeof(SERVER_REMOTE_BDADDR));
  
  // [STM] schedule to connect with BLE Server
  UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_1_ID, CFG_SCH_PRIO_0);
  
  //ble_oob_data_log(m_oob_uart_data.tk_size, m_oob_uart_data.tk);
}
/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
static void uart_rx_callback (void) // [STM]
{
  UTIL_SEQ_SetTask( 1<<CFG_TASK_OOB_PROCESS_ID, CFG_SCH_PRIO_0);
}

static void ble_oob_process (void) // [STM]
{
  APP_BLE_set_oob(&m_oob_remote_data);
}

static void ble_client_pairing_request(void) // [STM]
{
  tBleStatus ret = aci_gap_send_pairing_req(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,
                                            0x01); // [STM] Request pairing, force rebond
  APP_DBG_MSG("aci_gap_send_pairing_req, result: 0x%02X \n\r", ret);
}

static void ble_oob_data_log (uint32_t size, uint8_t *p_data)
{
  uint8_t msg[256];
  
  sprintf((char *) msg, "OOB TK Data generated by BLE client (size = %d) =", size);
  
  for(uint32_t k = 0; k < size; k++)
  {
    sprintf((char *)msg, "%s %02X", msg, p_data[k]);
  }
  APP_DBG_MSG("%s\r\n", msg);
}
/* USER CODE END FD_WRAP_FUNCTIONS */
